---
kind: other
id: Properties.T:Autodesk.Revit.DB.FaceEdgeNode
source: html/8d98f346-3124-7636-2f30-bf9192219688.htm
---
# FaceEdgeNode Properties

Specifies whether the .NET object represents a valid Revit entity.